content/man/man1/nix3-registry-add.1.org
#+TITLE: Manpages - nix3-registry-add.1
#+begin_quote
*Warning*\\
This program is *experimental* and its interface is subject to change.

#+end_quote

* Name
=nix registry add= - add/replace flake in user flake registry

* Synopsis
=nix registry add= [/option/...] /from-url/ /to-url/

* Examples
- Set the =nixpkgs= flake identifier to a specific branch of Nixpkgs:

#+begin_example
# nix registry add nixpkgs github:NixOS/nixpkgs/nixos-20.03
#+end_example

- Pin =nixpkgs= to a specific revision:

#+begin_example
# nix registry add nixpkgs github:NixOS/nixpkgs/925b70cd964ceaedee26fde9b19cc4c4f081196a
#+end_example

- Add an entry that redirects a specific branch of =nixpkgs= to another
  fork:

#+begin_example
# nix registry add nixpkgs/nixos-20.03 ~/Dev/nixpkgs
#+end_example

- Add =nixpkgs= pointing to =github:nixos/nixpkgs= to your custom flake
  registry:

#+begin_example
nix registry add --registry ./custom-flake-registry.json nixpkgs github:nixos/nixpkgs
#+end_example

* Description
This command adds an entry to the user registry that maps flake
reference /from-url/ to flake reference /to-url/. If an entry for
/from-url/ already exists, it is overwritten.

Entries can be removed using =nix registry= remove.

* Options
- =--registry= /registry/

  The registry to operate on.

** Common evaluation options
- =--arg= /name/ /expr/

  Pass the value /expr/ as the argument /name/ to Nix functions.

- =--arg-from-file= /name/ /path/

  Pass the contents of file /path/ as the argument /name/ to Nix
  functions.

- =--arg-from-stdin= /name/

  Pass the contents of stdin as the argument /name/ to Nix functions.

- =--argstr= /name/ /string/

  Pass the string /string/ as the argument /name/ to Nix functions.

- =--eval-store= /store-url/

  The *URL of the Nix store* to use for evaluation, i.e. to store
  derivations (=.drv= files) and inputs referenced by them.

- =--impure=

  Allow access to mutable paths and repositories.

- =--include= / =-I= /path/

  Add /path/ to search path entries used to resolve *lookup paths*

  This option may be given multiple times.

  Paths added through =-I= take precedence over the =nix-path=
  configuration setting and the =NIX_PATH= environment variable.

- =--override-flake= /original-ref/ /resolved-ref/

  Override the flake registries, redirecting /original-ref/ to
  /resolved-ref/.

** Logging-related options
- =--debug=

  Set the logging verbosity level to ‘debug'.

- =--log-format= /format/

  Set the format of log output; one of =raw=, =internal-json=, =bar= or
  =bar-with-logs=.

- =--print-build-logs= / =-L=

  Print full build logs on standard error.

- =--quiet=

  Decrease the logging verbosity level.

- =--verbose= / =-v=

  Increase the logging verbosity level.

** Miscellaneous global options
- =--help=

  Show usage information.

- =--offline=

  Disable substituters and consider all previously downloaded files
  up-to-date.

- =--option= /name/ /value/

  Set the Nix configuration setting /name/ to /value/ (overriding
  =nix.conf=).

- =--refresh=

  Consider all previously downloaded files out-of-date.

- =--repair=

  During evaluation, rewrite missing or corrupted files in the Nix
  store. During building, rebuild missing or corrupted store paths.

- =--version=

  Show version information.

  *Note*

  See =man nix.conf= for overriding configuration settings with command
  line flags.
