public/man/man1/nix3-registry-add.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - nix3-registry-add.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - nix3-registry-add.1</h1>
    
<p><strong>Warning</strong><br>
This program is <strong>experimental</strong> and its interface is subject to change.</p>
<p>#+end_quote</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Name
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p><code class="verbatim">nix registry add</code> - add/replace flake in user flake registry</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Synopsis
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><code class="verbatim">nix registry add</code> [/option/…] <em>from-url</em> <em>to-url</em></p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Examples
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<ul>
<li>Set the <code class="verbatim">nixpkgs</code> flake identifier to a specific branch of Nixpkgs:</li>
</ul>
<pre class="example">
# nix registry add nixpkgs github:NixOS/nixpkgs/nixos-20.03
</pre>
<ul>
<li>Pin <code class="verbatim">nixpkgs</code> to a specific revision:</li>
</ul>
<pre class="example">
# nix registry add nixpkgs github:NixOS/nixpkgs/925b70cd964ceaedee26fde9b19cc4c4f081196a
</pre>
<ul>
<li>Add an entry that redirects a specific branch of <code class="verbatim">nixpkgs</code> to another
fork:</li>
</ul>
<pre class="example">
# nix registry add nixpkgs/nixos-20.03 ~/Dev/nixpkgs
</pre>
<ul>
<li>Add <code class="verbatim">nixpkgs</code> pointing to <code class="verbatim">github:nixos/nixpkgs</code> to your custom flake
registry:</li>
</ul>
<pre class="example">
nix registry add --registry ./custom-flake-registry.json nixpkgs github:nixos/nixpkgs
</pre>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Description
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>This command adds an entry to the user registry that maps flake
reference <em>from-url</em> to flake reference <em>to-url</em>. If an entry for
<em>from-url</em> already exists, it is overwritten.</p>
<p>
Entries can be removed using <code class="verbatim">nix registry</code> remove.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Options
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<ul>
<li><code class="verbatim">--registry</code> <em>registry</em>

The registry to operate on.</li>
</ul>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Common evaluation options
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<ul>
<li><code class="verbatim">--arg</code> <em>name</em> <em>expr</em>

Pass the value <em>expr</em> as the argument <em>name</em> to Nix functions.</li>
<li><code class="verbatim">--arg-from-file</code> <em>name</em> <em>path</em>

Pass the contents of file <em>path</em> as the argument <em>name</em> to Nix
functions.</li>
<li><code class="verbatim">--arg-from-stdin</code> <em>name</em>

Pass the contents of stdin as the argument <em>name</em> to Nix functions.</li>
<li><code class="verbatim">--argstr</code> <em>name</em> <em>string</em>

Pass the string <em>string</em> as the argument <em>name</em> to Nix functions.</li>
<li><code class="verbatim">--eval-store</code> <em>store-url</em>

The <strong>URL of the Nix store</strong> to use for evaluation, i.e. to store
derivations (<code class="verbatim">.drv</code> files) and inputs referenced by them.</li>
<li><code class="verbatim">--impure</code>

Allow access to mutable paths and repositories.</li>
<li><code class="verbatim">--include</code> / <code class="verbatim">-I</code> <em>path</em>

Add <em>path</em> to search path entries used to resolve <strong>lookup paths</strong>

This option may be given multiple times.

Paths added through <code class="verbatim">-I</code> take precedence over the <code class="verbatim">nix-path</code>
configuration setting and the <code class="verbatim">NIX_PATH</code> environment variable.</li>
<li><code class="verbatim">--override-flake</code> <em>original-ref</em> <em>resolved-ref</em>

Override the flake registries, redirecting <em>original-ref</em> to
<em>resolved-ref</em>.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Logging-related options
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li><code class="verbatim">--debug</code>

Set the logging verbosity level to ‘debug&#39;.</li>
<li><code class="verbatim">--log-format</code> <em>format</em>

Set the format of log output; one of <code class="verbatim">raw</code>, <code class="verbatim">internal-json</code>, <code class="verbatim">bar</code> or
<code class="verbatim">bar-with-logs</code>.</li>
<li><code class="verbatim">--print-build-logs</code> / <code class="verbatim">-L</code>

Print full build logs on standard error.</li>
<li><code class="verbatim">--quiet</code>

Decrease the logging verbosity level.</li>
<li><code class="verbatim">--verbose</code> / <code class="verbatim">-v</code>

Increase the logging verbosity level.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Miscellaneous global options
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ul>
<li><code class="verbatim">--help</code>

Show usage information.</li>
<li><code class="verbatim">--offline</code>

Disable substituters and consider all previously downloaded files
up-to-date.</li>
<li><code class="verbatim">--option</code> <em>name</em> <em>value</em>

Set the Nix configuration setting <em>name</em> to <em>value</em> (overriding
<code class="verbatim">nix.conf</code>).</li>
<li><code class="verbatim">--refresh</code>

Consider all previously downloaded files out-of-date.</li>
<li><code class="verbatim">--repair</code>

During evaluation, rewrite missing or corrupted files in the Nix
store. During building, rebuild missing or corrupted store paths.</li>
<li><code class="verbatim">--version</code>

Show version information.

<strong>Note</strong>

See <code class="verbatim">man nix.conf</code> for overriding configuration settings with command
line flags.</li>
</ul>
</div>
</div>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
